package JavaCore.Level2.Lesson9.Task1;
//Задача 1
//Летать охота

//Уровень- EASY

/*Учитель JavaRush Риша Гейтсман на лекциях говаривал,
 что интерфейс есть законное дитя Абстракции и Полиморфизма.
 Начинаем его изучать. Вы когда-нибудь летали во сне?
 Мечтали о полёте наяву? Вот вам задачка: реализуйте интерфейс
 полёта с двумя методами. Справитесь? */
//Условие
/*
* Напиши свой public интрефейс
* CanFly(летать).
* Добавь в него ДВА метода.
* Требования:
* 1.Класс Solution Должен содержать интерейс CanFly
* 2. Интерфейс CanFly должен быть публичным
* 3. Интерфейс CanFly должен сожержать ДВА метода.
* 4. У интерфейса CanFly не должно быть родителей.

* */


public class Solution {

    public static void main(String[] args) {

    }
    public interface  CanFly{  //добавляем имплементирование Интерфейса

        void m1();
        void ma2();
    }


}
