package Level7.Lesson4.Task5;
//ЗАДАЧА 5
// Один дольшой массив и два маленьких
// Уровень - MEDIUM
//1. Создать массив на 20 чисел.
  //      2. Ввести в него значения с клавиатуры.
    //    3. Создать два массива на 10 чисел каждый.
      //  4. Скопировать большой массив в два маленьких: половину чисел в первый маленький, вторую половину во второй маленький.
        //5. Вывести второй маленький массив на экран, каждое значение выводить с новой строки.

        //Требования:
        //Программа должна создавать большой массив на 20 целых чисел.
        //Программа должна считывать с клавиатуры 20 чисел для большого массива.
        //Программа должна создавать два маленьких массива на 10 чисел каждый.
        //Программа должна скопировать одну половину большого массива в первый маленький, а вторую - во второй и вывести второй маленький массив на экран.
public class Solution {
            public static void main(String[] args) {

            }

}
