package Level7.Lesson9.Task4;
//ЗАДАЧА 4
// Р или Л
// Уровень - HARD

//Друзья секретного центра JavaRush с планеты Ки-Тай столкнулись с одной нестандартной для нас проблемой:
// они плохо различают буквы «р» и «л». Мы решили им помочь следующей задачей.
// В созданном списке слов экспериментальный метод fix будет удалять из списка строк все слова,
// содержащие букву «р», а все слова, содержашие букву «л» — удваивать.

//1. Создай список слов, заполни его самостоятельно.
//        2. Метод fix должен:
//        2.1. удалять из списка строк все слова, содержащие букву "р"
//        2.2. удваивать все слова содержащие букву "л".
//        2.3. если слово содержит и букву "р" и букву "л", то оставить это слово без изменений.
//        2.4. с другими словами ничего не делать.
//
//        Пример:
//        роза
//        лира
//        лоза
//
//        Выходные данные:
//        лира
//        лоза
//        лоза
//
//        Требования:
//        Программа не должна считывать данные с клавиатуры.
//        Метод fix должен удалять из списка строк все слова, содержащие букву "р". Исключение: слова содержащие и букву "р" и букву "л" - их нужно оставить.
//        Метод fix должен удваивать слова, содержащие букву "л" (добавлять еще один элемент с этим словом). Исключение: слова содержащие и букву "л" и букву "р" - их не нужно удваивать.
//        Метод fix не должен ничего делать со словами, содержащими и букву "л" и букву "р".
//        Метод fix не должен ничего делать со словами, которые не содержат ни букву "л", ни букву "р".

public class Sulution {
    public static void main(String[] args) {

    }
}
